#include <stdio.h>

int main()
{

  /**
   * 변수(variable)
   * : 데이터를 저장하기 위해 프로그램에 의해 이름을 할당받은 메모리 공간
   * 즉, 변수란 데이터를 저장할 수 있는 메모리 공간
   * 정수형은 char,int,long
   * 실수형은 float, double형이 있다.
   * 
   * 또한 데이터가 저장된 메모리의 주소를 저장하고 처리하는 포인터 변수가 있다
   * 관련된 정보를 한 번에 묶어서 처리하는 사용자 정의 구조체 변수도 있음.
   * 
   * 참고로~~
   * 변수의 이름에 대소문자를 구분하므로
   * int tcp와 int Tcp는 다른 변수이다.
   */

  /**
   * 변수와 메모리 구조
   * 
   * 변수는 기본적으로 메모리의 주소(address)를 기억하는 역할을 함
   * 메모리 주소란 물리적인 공간을 서로 구분하기 위해 사용되는 일종의 식별자이다.
   * 즉, 메모리 주소란 메모리 공간에서의 정확한 위치를 식별하기 위한 고유 주소를 의미함
   * 
   * 변수를 참조할 때는 해당 주소에 저장된 데이터를 참조하게 된다.
   * 변수는 데이터가 저장된 메모리의 주소뿐만 아니라, 저장된 데이터의 길이와 형태에 관한 정보도 같이 기억해야함.
   * 
   */

  
  return 0;
}